Barfell/work/张成宇/PDM/001_RD15001/file/LPC1788_nandyaffs/nandyaffs/Drivers/SST39VF6401.c
/************************************************************************/
/* PROCEDURE:   SecID_Query                                             */
/*                                                                      */
/* This procedure should be used to query for Security ID information.  */
/*                                                                      */
/* Input:                                                               */
/*          SST_SecID	Source address to store SST SecID string	*/
/*          User_SecID	Source address to store User SecID string	*/
/*                                                                      */
/* Output:                                                              */
/*          None                                                        */
/************************************************************************/
void SecID_Query(uint16_t *SST_SecID, uint16_t *User_SecID)
{
     uint16_t index;
	     //  Issue the SecID Entry code to 39VF640X
    *sysAddress(0x555) = 0x00AA;  // write data 0x00AA to device addr 0x5555
    *sysAddress(0x2AA) = 0x0055;  // write data 0x0055 to device addr 0x2AAA
    *sysAddress(0x555) = 0x0088;  // write data 0x0088 to device addr 0x5555
    Delay(1);      // insert delay time = Tida

    	//  Perform all Security ID operations here:
    	//  	SST programmed segment is from address 000000H--000007H,
    	//  	User programmed segment is from address 000010H--000017H.

    for (index = 0x0000; index <= 0x0007; index++)
    {
    	 *SST_SecID = *sysAddress(index);
         ++SST_SecID;
         *User_SecID = *sysAddress(index+0x0010);
         ++User_SecID;
	// Security query data is stored in user-defined memory space.
    }
        // Issue the Sec ID Exit code thus returning the 39VF640X
        // to the read operating mode
    *sysAddress(0x555) = 0x00AA;  // write data 0x00AA to device addr 0x5555
    *sysAddress(0x2AA) = 0x0055;  // write data 0x0055 to device addr 0x2AAA
    *sysAddress(0x555) = 0x00F0;  // write data 0x00F0 to device addr 0x5555
    Delay(1);      // insert delay time = Tida
}


/************************************************************************/
/* PROCEDURE:   Erase_One_Sector                                        */
/*                                                                      */
/* This procedure can be used to erase a total of 2048 uint16_ts.           */
/*                                                                      */
/* Input:                                                               */
/*      Dst     DESTINATION address where the erase operation starts    */
/*                                                                      */
/* Output:                                                              */
/*          return TRUE:  indicates success in sector-erase             */
/*          return FALSE: indicates failure in sector-erase             */
/************************************************************************/
int Erase_One_Sector(uint32_t Dst)
{
	uint32_t DestBuf = Dst;
   int  ReturnStatus;

	//  Issue the Sector Erase command to 39VF640X
	*sysAddress(0x555) = 0x00AA;     // write data 0x00AA to device addr 0x5555
	*sysAddress(0x2AA) = 0x0055;     // write data 0x0055 to device addr 0x2AAA
	*sysAddress(0x555) = 0x0080;     // write data 0x0080 to device addr 0x5555
	*sysAddress(0x555) = 0x00AA;     // write data 0x00AA to device addr 0x5555
	*sysAddress(0x2AA) = 0x0055;     // write data 0x0055 to device addr 0x2AAA
	*sysAddress(DestBuf) = 0x0050;    // write data 0x0050 to device sector addr

   ReturnStatus = Check_Toggle_Ready(DestBuf);	// wait for TOGGLE bit ready

   return ReturnStatus;
}


/************************************************************************/
/* PROCEDURE:   Erase_One_Block                                         */
/*                                                                      */
/* This procedure can be used to erase a total of 32K uint16_ts.            */
/*                                                                      */
/* Input:                                                               */
/*      Dst     DESTINATION address where the erase operation starts    */
/*                                                                      */
/* Output:                                                              */
/*          return TRUE:  indicates success in block-erase              */
/*          return FALSE: indicates failure in block-erase              */
/************************************************************************/
int Erase_One_Block (uint32_t Dst)
{
   uint32_t DestBuf = Dst;
   int ReturnStatus;

    //  Issue the Block Erase command to 39VF640X
	*sysAddress(0x555) = 0x00AA;     // write data 0x00AA to device addr 0x5555
	*sysAddress(0x2AA) = 0x0055;     // write data 0x0055 to device addr 0x2AAA
	*sysAddress(0x555) = 0x0080;     // write data 0x0080 to device addr 0x5555
	*sysAddress(0x555) = 0x00AA;     // write data 0x00AA to device addr 0x5555
	*sysAddress(0x2AA) = 0x0055;     // write data 0x0055 to device addr 0x2AAA
	*sysAddress(DestBuf) = 0x0030;    // write data 0x0050 to device sector addr

   ReturnStatus = Check_Toggle_Ready(DestBuf);	  	// wait for TOGGLE bit ready

   return ReturnStatus;
}


/************************************************************************/
/* PROCEDURE:   Erase_Entire_Chip                                       */
/*                                                                      */
/* This procedure can be used to erase the entire chip.                 */
/*                                                                      */
/* Input:                                                               */
/*      NONE                                                            */
/*                                                                      */
/* Output:                                                              */
/*      NONE                                                            */
/************************************************************************/
int Erase_Entire_Chip(void)
{
   //  Issue the Chip Erase command to 39VF640X
	*sysAddress(0x555) = 0x00AA;     // write data 0x00AA to device addr 0x555
	*sysAddress(0x2AA) = 0x0055;     // write data 0x0055 to device addr 0x2AA
	*sysAddress(0x555) = 0x0080;     // write data 0x0080 to device addr 0x555
	*sysAddress(0x555) = 0x00AA;     // write data 0x00AA to device addr 0x555
	*sysAddress(0x2AA) = 0x0055;     // write data 0x0055 to device addr 0x2AA
	*sysAddress(0x555) = 0x0010;     // write data 0x0010 to device addr 0x555

   delay_ns(100);       	// Delay Tsce time
   if (Check_Data_Polling (0,0xFFFF))
   	return TRUE;
   else
    return FALSE;
}


