Barfell/work/张成宇/PDM/001_RD15001/file/LPC1788_nandyaffs/nandyaffs/Drivers/SST39VF6401.c
        if (!ReturnStatus)
    	return ReturnStatus;
    }

    return ReturnStatus;
}


/************************************************************************/
/* PROCEDURE:   SecID_Lock_Status                                       */
/*                                                                      */
/* This procedure should be used to check the Lock Status of SecID	*/
/*                                                                      */
/* Input:                                                               */
/*          None                                                        */
/*                                                                      */
/* Output:                                                              */
/*          return TRUE:  indicates SecID is Locked  			 */
/*          return FALSE: indicates SecID is Unlocked  	  	 */
/************************************************************************/
int SecID_Lock_Status(void)
{
    uint16_t SecID_Status;

         //  Issue the Sec ID Entry code to 39VF640X
    *sysAddress(0x555) = 0x00AA;  // write data 0x00AA to device addr 0x5555
    *sysAddress(0x2AA) = 0x0055;  // write data 0x0055 to device addr 0x2AAA
    *sysAddress(0x555) = 0x0088;  // write data 0x0088 to device addr 0x5555
    Delay(1);      // insert delay time = Tida

    	//  Read Lock Status of SecID segment
    SecID_Status = *sysAddress(0x00FF);
    SecID_Status &= 0x0008; // Unlocked: DQ3=1; Locked: DQ3=0

        // Issue the Sec ID Exit code thus returning the 39VF640X
        // to the read operating mode
    *sysAddress(0x555) = 0x00AA;  // write data 0x00AA to device addr 0x5555
    *sysAddress(0x2AA) = 0x0055;  // write data 0x0055 to device addr 0x2AAA
    *sysAddress(0x555) = 0x00F0;  // write data 0x00F0 to device addr 0x5555
    Delay(1);      // insert delay time = Tida

    if (!SecID_Status)
    	return TRUE;		   // SecID segment is Locked

    return FALSE;   		   // SecID segment is Unlocked
}


/************************************************************************/
/* PROCEDURE:   User_SecID_uint16_t_Program                                 */
/*                                                                      */
/* This procedure can be used to program data into the User SecID       */
/* segment (from 000010H--000017H) in 39VF640X.       			*/
/*                                                                      */
/* NOTE:  1. It's recommended to lock out the SecID segment after the 	*/
/*	  completion of program.					*/
/*	  2. There's no way to unlock the SecID segment once it's	*/ 
/*	  locked.							*/
/*                                                                      */
/* Input:                                                               */
/*           Srcuint16_t	Source address to fetch data			*/
/*           Dst  	Destination address to write data		*/
/*           length  	number of uint16_t needs to be programmed		*/
/*                                                                      */
/* Output:                                                              */
/*          return TRUE:  indicates SecID program is successful         */
/*          return FALSE: indicates SecID program is failed or SecID    */
/*			  is locked.					*/
/************************************************************************/
int User_SecID_uint16_t_Program (uint16_t *Srcuint16_t, uint16_t *Dst, int length)
{
    uint16_t *DestBuf = Dst;
    uint16_t *SourceBuf = Srcuint16_t;
    int test, index=length;

    test = SecID_Lock_Status ();  // check whether the SecID is Locked or not
    if (test)                     // TRUE: SecID is Locked
    	return FALSE;

    while (index--)
    {
    	*sysAddress(0x555) = 0x00AA; // write data 0x00AA to device addr 0x5555
    	*sysAddress(0x2AA) = 0x0055; // write data 0x0055 to device addr 0x2AAA
    	*sysAddress(0x555) = 0x00A5; // write data 0x00A5 to device addr 0x5555
    	*sysAddress(*DestBuf) = *SourceBuf; // transfer the uint16_t to destination	 YJ
      ++DestBuf;
      ++SourceBuf;
    	// Read the toggle bit to detect end-of-write for the Sec ID.
      	// Do Not use Data# Polling for User_SecID_uint16_t_Program.
      test = Check_Toggle_Ready((uint32_t)DestBuf); // wait for TOGGLE bit to get ready
      if (!test)
    	return FALSE;   // SecID uint16_t-Program failed!
    }

    return TRUE;
}


/************************************************************************/
/* PROCEDURE:   User_SecID_Lock_Out                                     */
/*                                                                      */
/* This procedure can be used to Lock Out the User Seccurity ID.        */
/* User Security ID segment, from 000010H--000017H, in 39VF640X.        */
/*                                                                      */
/* NOTE:  1. Call SecID_Lock_Status() first to verify the SecID is 	*/
/*	  unlocked.							*/
/*	  2. SecID segment can't be erased.				*/
/*	  3. SecID segment can't be unlocked once it's locked.		*/
/*                                                                      */
/* Input:    None                                                       */
/*                                                                      */
/* Output:   None                                                       */
/************************************************************************/
void User_SecID_Lock_Out (void)
{
    *sysAddress(0x555) = 0x00AA; // write data 0x00AA to device addr 0x5555
    *sysAddress(0x2AA) = 0x0055; // write data 0x0055 to device addr 0x2AAA
    *sysAddress(0x555) = 0x0085; // write data 0x0085 to device addr 0x5555
    *sysAddress(0x00F) = 0x0000; // write data 0x0000 to any addr

    Delay(1);	// Wait for uint16_t-Program timeout, Tbp=10us
}


/************************************************************************/
/* PROCEDURE:   Erase_Suspend		                		*/
/*                                                                      */
/* This procedure can be used to temporarily suspend a Sector/Block-	*/
/* Erase operation in 39VF640X.  					*/
/*                                                                      */
/* Input:    None                                                       */
/*                                                                      */
/* Output:   None                                                       */
/************************************************************************/
void Erase_Suspend (void)
{
    *sysAddress(0x555) = 0x00B0; // write data 0x00B0 to any addr, i.e. 0x5555

    Delay(1);	// The device automatically enters read mode
    		// typically within 20 us after the Erase-Suspend command issued.
}


