Barfell/work/张成宇/PDM/001_RD15001/file/LPC1788_nandyaffs/nandyaffs/Drivers/SST39VF6401.c
/************************************************************************/
/* PROCEDURE:   Erase_Resume		              			*/
/*                                                                      */
/* This procedure can be used to resume a Sector-Erase or Block-Erase   */
/* operation that had been suspended in 39VF640X.  	 		*/
/*                                                                      */
/* Input:    None                                                       */
/*                                                                      */
/* Output:   None                                                       */
/************************************************************************/
void Erase_Resume (void)
{
    *sysAddress(0x555) = 0x0030; // write data 0x0030 to any addr, i.e. 0x5555
}


/************************************************************************/
/* PROCEDURE:    Check_Toggle_Ready                                     */
/*                                                                      */
/* During the internal program cycle, any consecutive read operation    */
/* on DQ6 will produce alternating 0's and 1's i.e. toggling between    */
/* 0 and 1. When the program cycle is completed, DQ6 of the data will   */
/* stop toggling. After the DQ6 data bit stops toggling, the device is  */
/* ready for next operation.                                            */
/*                                                                      */
/* Input:                                                               */
/*           Dst        must already be set-up by the caller            */
/*                                                                      */
/* Output:   TRUE   Data toggling success                               */
/*           FALSE  Time out                                            */
/************************************************************************/
int Check_Toggle_Ready (uint32_t Dst)
{
    uint16_t PreData;
    uint16_t CurrData;
    unsigned long TimeOut = 0;

    PreData = *sysAddress(Dst);
    PreData = PreData & 0x0040;          // read DQ6
    while (TimeOut < MAX_TIMEOUT)	 // MAX_TIMEOUT=0x07FFFFFF
    {
        CurrData = *sysAddress(Dst);
        CurrData = CurrData & 0x0040;    // read DQ6 again
        if (PreData == CurrData)
        {
	    return TRUE;
        }
	PreData = CurrData;
        TimeOut++;
    }
    return FALSE;
}


/************************************************************************/
/* PROCEDURE:   Check_Data_Polling                                      */
/*                                                                      */
/* During the internal program cycle, any attempt to read DQ7 of the    */
/* last uint8_t loaded during the page/uint8_t-load cycle will receive the    */
/* complement of the true data.  Once the program cycle is completed,   */
/* DQ7 will show true data.                                             */
/*                                                                      */
/* Input:                                                               */
/*           Dst        must already be set-up by the caller            */
/*           TrueData 	this is the original (true) data            	*/
/*                                                                      */
/* Output:                                                              */
/*           TRUE   Data polling success                                */
/*           FALSE  Time out                                            */
/************************************************************************/
int Check_Data_Polling (uint32_t Dst, uint16_t TrueData)
{
    uint16_t CurrData;
    unsigned long int TimeOut = 0;

    TrueData = TrueData & 0x0080; 	// read D7
    while (TimeOut < MAX_TIMEOUT)	// MAX_TIMEOUT=0x07FFFFFF
    {
	 CurrData = *sysAddress(Dst);
	 CurrData = CurrData & 0x0080;   // read DQ7
	 if (TrueData == CurrData)
         {
	    return TRUE;
         }
	 TimeOut++;
    }
    return FALSE;
}  

